Tekla Open API Reference for Tekla Structures 2025
AngleDimensionAttributes Constructor
 Creates a new angle dimension attributes instance which loads standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AngleDimensionAttributes()
Public Sub New
See Also
Reference
AngleDimensionAttributes Class
AngleDimensionAttributes Overload
Tekla.Structures.Drawing Namespace